In [12]:
#Get username and password
from config import username, password

In [13]:
#Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import psycopg2
from sqlalchemy import create_engine

In [14]:
#Create a connection to the database
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/employee_db')
connection = engine.connect()

In [15]:
#Read and display title table data
title_data = pd.read_sql("SELECT * FROM titles", connection) 
title_data.head()

   emp_no            title   from_date     to_date  t_id
0   10001  Senior Engineer  1986-06-26  9999-01-01     1
1   10002            Staff  1996-08-03  9999-01-01     2
2   10003  Senior Engineer  1995-12-03  9999-01-01     3
3   10004         Engineer  1986-12-01  1995-12-01     4
4   10004  Senior Engineer  1995-12-01  9999-01-01     5

In [16]:
#Read and display salaries table data
sal_data = pd.read_sql("SELECT * FROM salaries", connection) 
sal_data.head()

   emp_no  salary   from_date     to_date  s_id
0   10001   60117  1986-06-26  1987-06-26     1
1   10002   65828  1996-08-03  1997-08-03     2
2   10003   40006  1995-12-03  1996-12-02     3
3   10004   40054  1986-12-01  1987-12-01     4
4   10005   78228  1989-09-12  1990-09-12     5

In [17]:
#Merge the data frames
df = pd.merge(title_data, sal_data, on="emp_no")
df.head()

,emp_no,title,from_date_x,to_date_x,t_id,salary,from_date_y,to_date_y,s_id
0,10001,Senior Engineer,1986-06-26,9999-01-01,1,60117,1986-06-26,1987-06-26,1
1,10002,Staff,1996-08-03,9999-01-01,2,65828,1996-08-03,1997-08-03,2
2,10003,Senior Engineer,1995-12-03,9999-01-01,3,40006,1995-12-03,1996-12-02,3
3,10004,Engineer,1986-12-01,1995-12-01,4,40054,1986-12-01,1987-12-01,4
4,10004,Senior Engineer,1995-12-01,9999-01-01,5,40054,1986-12-01,1987-12-01,4

In [18]:
#Display the relevant columns
df1 = df[["title", "salary"]]
df1.head()

             title  salary
0  Senior Engineer   60117
1            Staff   65828
2  Senior Engineer   40006
3         Engineer   40054
4  Senior Engineer   40054

In [19]:
#Group the data by title
grouped_df = df1.groupby(["title"])
grouped_df

In [20]:
#Display the salaries as currency rounded to the nearest dollar
pd.options.display.float_format = '${:,.0f}'.format
grouped_df

*****_How do I display it with title and salary side by side?_*****